public class TestService {
    public static void main(String[] args) {
        int x = 1000;
        // х - стоимость билета, рублей
        int a = 20;
        // а - 1 бонусная миля, рублей
        int b = x/a;
        // b - колличество бонусов
        System.out.println("Вам начислено " + b + " бонусных милей");

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}